# -*- org-export-babel-evaluate: t; org-link-file-path-type: relative;-*-
#+TITLE: Lab Book for PMQ Experiments 
#+LANGUAGE: en 
#+STARTUP: indent
#+STARTUP: logdrawer hideblocks
#+SEQ_TODO: TODO INPROGRESS(i) | DONE DEFERRED(@) CANCELED(@)
#+SEQ_TODO: TODO RUNNING RERUN ANALYSIS | FINISHED CANCELED(@)
#+TAGS: @JULIO(J) @CICERO(C)
#+TAGS: IMPORTANT(I) ignore(i) TEST(t) DEPRECATED(d) noexport(n) export(e) paper(p)
#+CATEGORY: TwitterVis
#+OPTIONS: ^:{} H:3 author:nil
#+PROPERTY: header-args :cache no :eval never-export


Labbook about implementation of the PMQ

***** Setup                                                    :noexport:

- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
set -e
expId=$(date +%Y%m%d%H%M%S)
machineDesc="cicero"
expFolder=./data/$machineDesc/exp$expId
mkdir -p $expFolder
#+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 DATA --oneline | cat
  git show DATA:./data/cicero/exp20170822165129/exp.org > ${expFolder}/exp.org

  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  0b5f0d6 UPD: fixed paths
  $ $ [[./data/cicero/exp20170907112116/exp.org]]

***** Setup                                                    :noexport:
- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
  set -e
  expId=$(date +%Y%m%d%H%M%S)
  machineDesc="cicero"
  expFolder=./data/$machineDesc/exp$expId
  mkdir -p $expFolder
  #+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 DATA --oneline | cat
  git show DATA:./data/cicero/exp20170907112116/exp.org > ${expFolder}/exp.org
  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  b299a4e Merge branch 'master' into DATA
  $ [[./data/cicero/exp20170919161448/exp.org]]


***** Setup                                                    :noexport:
- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
  set -e
  expId=$(date +%Y%m%d%H%M%S)
  machineDesc="cicero"
  expFolder=./data/$machineDesc/exp$expId
  mkdir -p $expFolder
  #+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 DATA --oneline | cat
  git show DATA:./data/cicero/exp20170919161448/exp.org > ${expFolder}/exp.org
  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  2e44f88 Merge branch 'exp20170923144931' into DATA
  $ [[./data/cicero/exp20170923193058/exp.org]]

***** Setup                                                    :noexport:

- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
set -e
expId=$(date +%Y%m%d%H%M%S)
machineDesc=cicero
expFolder=./data/$machineDesc/exp$expId
mkdir -p $expFolder
echo $expFolder
#+end_src

  #+RESULTS:
  : 
  : $ $ $ $ ./data/cicero/exp20170904153555
  
- [X] Use the template to run your experiment
  
  #+begin_src sh :results output raw :exports both :session template
  git log -1 exp20170825181747 --oneline | cat
  git show exp20170825181747:./data/cicero/exp20170825181747/exp.org > ${expFolder}/exp.org

  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  cadbec3 wip exp
  $ $ [[./data/cicero/exp20170904153555/exp.org]]
  
***** Setup                                                    :noexport:

- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
set -e
expId=$(date +%Y%m%d%H%M%S)
machineDesc="cicero"
expFolder=./data/$machineDesc/exp$expId
mkdir -p $expFolder
#+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 exp20170907145711 --oneline | cat
  git show exp20170907145711:./data/cicero/exp20170907145711/exp.org > ${expFolder}/exp.org

  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  2a5b5d2 UPD: report in markdown
  $ $ [[./data/cicero/exp20170915143003/exp.org]]

***** Setup                                                    :noexport:

- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
set -e
expId=$(date +%Y%m%d%H%M%S)
machineDesc="cicero"
expFolder=./data/$machineDesc/exp$expId
mkdir -p $expFolder
#+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 DATA --oneline | cat
  git show DATA:./data/cicero/exp20170915143003/exp.org > ${expFolder}/exp.org

  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  6c231da minor chgs
  $ $ [[./data/cicero/exp20170923144931/exp.org]]


***** Setup                                                    :noexport:

- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
set -e
expId=$(date +%Y%m%d%H%M%S)
machineDesc="cicero"
expFolder=./data/$machineDesc/exp$expId
mkdir -p $expFolder
#+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 DATA --oneline | cat
  git show DATA:./data/cicero/exp20170907112116/exp.org > ${expFolder}/exp.org

  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  22e9c95 upd exp info
  $ $ [[./data/cicero/exp20170914091842/exp.org]]

***** Setup                                                    :noexport:

- [X] Create a direcorty for this experiment 
  #+begin_src sh :results output :exports both :session template
set -e
expId=$(date +%Y%m%d%H%M%S)
machineDesc="cicero"
expFolder=./data/$machineDesc/exp$expId
mkdir -p $expFolder
#+end_src

  #+RESULTS:
  
- [X] Use the template to run your experiment
  #+begin_src sh :results output raw :exports both :session template
  git log -1 DATA --oneline | cat
  git show DATA:./data/cicero/exp20170914091842/exp.org > ${expFolder}/exp.org

  echo "[[$expFolder/exp.org]]"
  #+end_src

  #+RESULTS:
  dfa5355 typos
  $ $ [[./data/cicero/exp20170925155952/exp.org]]

